# 베이스 이미지를 명시해준다.
# 이미지 생성시 기반이 되는 이미지 레이어입니다. 
# <이미지 이름><태그> 형식으로 작성
# 태그를 안 붙이면 자동적으로 가장 최신것을 다운 받는다.
# FROM baseImage
FROM alpine

# 추가적으로 필요한 파일들을 다운로드 받는다.
# 도커 이미지가 생성되기 전에 수행할 쉘 명령어
# RUN command
# ex) hello 출력만 수행할 것이므로 이 부분이 필요 없음.

# 컨테이너 시작시 실행될 명령어를 명시해준다.
# CMD ["executable"]
CMD ["echo", "hello"]

# 도커 파일에 입력된 것들이 도커 클라이언트에 전달되어서 도커 서버가 인식하게 하여야 한다. => docker build ./
# 베이스 이미지 6e30ab57aeee 를 임시 컨테이너에 넣어주고 be20c5718856, 
# -> 임시 컨테이너를 토대로 새로운 이미지가 생성된 것임. 2c124e853184
# -> 임시 컨테이너 삭제된다.